app/views/reservations/your_reservations.html.erb

        <% @rooms.each do |room| %>
            <% room.reservations.each do |reservation| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."room_id" = ?  [["room_id", 1]]