app/views/rooms/_room_menu.html.erb

    <%= link_to "Photos", photo_upload_room_path, class: "sidebar-link active" %>
    <% if !@room.photos.blank? %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."room_id" = ?  [["room_id", 1]]