app/views/photos/_photos_list.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."room_id" = ?  [["room_id", 1]]
SELECT COUNT(*) FROM "photos" WHERE "photos"."room_id" = ?  [["room_id", 1]]
---
<% if @room.photos.count > 0 %>