app/controllers/reservations_controller.rb

  def create
    room = Room.find(params[:room_id])

    if current_user == room.user
      flash[:alert] = "You cannot book your own property!"
    elsif current_user.stripe_id.blank?
      flash[:alert] = "Please update your payment method."
      return redirect_to payment_method_path
    else
      start_date = Date.parse(reservation_params[:start_date])
      end_date = Date.parse(reservation_params[:end_date])
      days = (end_date - start_date).to_i + 1

      special_dates = room.calendars.where(
        "status = ? AND day BETWEEN ? AND ? AND price <> ?",
        0, start_date, end_date, room.price
      )

      @reservation = current_user.reservations.build(reservation_params)
      @reservation.room = room
      @reservation.price = room.price
      @reservation.total = room.price * days
      @reservation.save
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "room_id", "start_date", "end_date", "price", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def your_trips
    @trips = current_user.reservations.order(start_date: :asc)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? ORDER BY "reservations"."start_date" ASC  [["user_id", 12]]