app/controllers/rooms_controller.rb

  def create
     @room = current_user.rooms.build(room_params)
    if @room.save
---
INSERT INTO "rooms" ("home_type", "room_type", "accommodate", "bed_room", "bath_room", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    new_params = room_params
    new_params = room_params.merge(active: true) if is_ready_room

    if @room.update(new_params)
---
UPDATE "rooms" SET "active" = ?, "home_type" = ?, "room_type" = ?, "accommodate" = ?, "bed_room" = ?, "bath_room" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["active", "t"], ["home_type", "House"], ["room_type", "Shared"], ["accommodate", 4], ["bed_room", 3], ["bath_room", 2], ["updated_at", "2018-02-20 07:28:26.812483"], ["id", 3]]

  def preload
    today = Date.today
   reservations = @room.reservations.where("(start_date >= ? OR end_date >= ?) AND status = ?", today, today, 1)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."room_id" = ? AND (start_date >= '2019-04-05' OR end_date >= '2019-04-05')  [["room_id", 1]]

    def set_room
      @room = Room.find(params[:id])
---
SELECT rooms.*, (111.19492664455873 * ABS(rooms.latitude - 40.8106909090909) * 0.7071067811865475) + (96.29763124613503 * ABS(rooms.longitude - -79.5343122727273) * 0.7071067811865475) AS distance, CASE WHEN (rooms.latitude >= 40.8106909090909 AND rooms.longitude >= -79.5343122727273) THEN  45.0 WHEN (rooms.latitude <  40.8106909090909 AND rooms.longitude >= -79.5343122727273) THEN 135.0 WHEN (rooms.latitude <  40.8106909090909 AND rooms.longitude <  -79.5343122727273) THEN 225.0 WHEN (rooms.latitude >= 40.8106909090909 AND rooms.longitude <  -79.5343122727273) THEN 315.0 END AS bearing FROM "rooms" WHERE (rooms.latitude BETWEEN 40.72075874849903 AND 40.90062306968277 AND rooms.longitude BETWEEN -79.65313292872742 AND -79.4154916167272 AND rooms.id != 2) ORDER BY distance ASC